# Introduction to Jupyter Notebooks

##  A lesson in Markdown

### Use it to create rich text in a plain text editor

  This is my first lesson in Markdown. 
  I'm doing really well!

This is **really** interesting.

This is _interesting_.

In [3]:
# For comments inside the code cell use a hash

In [4]:
1:9

[1] 1 2 3 4 5 6 7 8 9

In [5]:
sum(1:9)

[1] 45

In [7]:
x = c(3,5,8,9)
sum(x)

[1] 25

In [8]:
y = c("Jack", "Queen", "King")
  y [1]

[1] "Jack"

In [10]:
y = c("Jack", "Queen", "King")
y [3]

[1] "King"

In [13]:
matrix(y,3,4,byrow=F)

     [,1]  [,2]  [,3]  [,4]
[1,] Jack  Jack  Jack  Jack
[2,] Queen Queen Queen Queen
[3,] King  King  King  King

In [18]:
employee <-c("Juanita Lopez", "Peter Gynn", "Jolie Talofa")
salary <-c(81000, 83400, 96800)
startdate <-as.Date(c("2010-11-1", "2008-3-25", "2007-3-14"))

In [19]:
employ.data <- data.frame(employee, salary, startdate)
employ.data <- data.frame(employee, salary, startdate, stringsAsFactors = FALSE)
employ.data

  employee      salary startdate
1 Juanita Lopez 81000  2010-11-01
2 Peter Gynn    83400  2008-03-25
3 Jolie Talofa  96800  2007-03-14